# IsCalculatedField Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleField..::..IsCalculatedField Property
ScheduleField Class See Also
---
Indicates if the field is a calculated field (Formula or Percentage).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsCalculatedField { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsCalculatedField As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsCalculatedField {
	bool get ();
}
```

# See Also
ScheduleField Class
Autodesk.Revit.DB Namespace